In [49]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        user="root",
                        password="MySQL"
                        )

sql_cek_databases = "show databases"

databases = pd.read_sql(sql_cek_databases, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(databases)

MySQL Connection is Close

             Database
0       belajar_mysql
1       dqlab_academy
2  information_schema
3               mysql
4  performance_schema
5              sakila
6                 sys
7               world

In [50]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_cek_tables = "show tables"

tables = pd.read_sql(sql_cek_tables, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(tables)

MySQL Connection is Close

   Tables_in_dqlab_academy
0        customer_segments
1              data_retail
2         ms_item_kategori
3            ms_item_warna
4             ms_pelanggan
5               ms_product
6               online_raw
7            payment_fraud
8       retail_raw_reduced
9                 students
10                 tabel_a
11                 tabel_b
12            tr_penjualan

## Penggabungan Tabel dan Relasi Kolom

In [51]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_cek_tables = "show tables"

tables = pd.read_sql(sql_cek_tables, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(tables)

MySQL Connection is Close

   Tables_in_dqlab_academy
0        customer_segments
1              data_retail
2         ms_item_kategori
3            ms_item_warna
4             ms_pelanggan
5               ms_product
6               online_raw
7            payment_fraud
8       retail_raw_reduced
9                 students
10                 tabel_a
11                 tabel_b
12            tr_penjualan

In [52]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

df_ms_item_kategori = pd.read_sql(sql_ms_item_kategori, connection)
df_ms_itme_warna = pd.read_sql(sql_ms_item_warna, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(df_ms_item_kategori)
display(df_ms_itme_warna)

MySQL Connection is Close

   nama_item kategori
0      bayam  sayuran
1  belimbing     buah
2       duku     buah
3     durian     buah
4     gandum     buah
5      jamur  sayuran
6  jambu air     buah
7      jeruk     buah

   nama_barang         warna
0         apel         merah
1        bayam         hijau
2  daun bawang         hijau
3         duku  kuning pekat
4       durian        kuning
5       gandum        coklat
6    jambu air         merah
7        jeruk        oranye

In [53]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

sql_code = "select * from ms_item_kategori, ms_item_warna where nama_barang = nama_item"
dataset = pd.read_sql(sql_code, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")
 
display(dataset)

MySQL Connection is Close

   nama_item kategori nama_barang         warna
0      bayam  sayuran       bayam         hijau
1       duku     buah        duku  kuning pekat
2     durian     buah      durian        kuning
3     gandum     buah      gandum        coklat
4  jambu air     buah   jambu air         merah
5      jeruk     buah       jeruk        oranye

In [54]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

ms_item_kategori = "select * from ms_item_kategori"
ms_item_warna = "select * from ms_item_warna"

df_ms_item_kategori = pd.read_sql(ms_item_kategori, connection)
df_ms_item_warna = pd.read_sql(ms_item_warna, connection)

merge_inner_join = pd.merge(df_ms_item_kategori, df_ms_item_warna, how="inner", left_on="nama_item", right_on="nama_barang")

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")
 
display(merge_inner_join)

MySQL Connection is Close

   nama_item kategori nama_barang         warna
0      bayam  sayuran       bayam         hijau
1       duku     buah        duku  kuning pekat
2     durian     buah      durian        kuning
3     gandum     buah      gandum        coklat
4  jambu air     buah   jambu air         merah
5      jeruk     buah       jeruk        oranye

In [55]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

sql_code = "select * from ms_item_warna, ms_item_kategori where nama_barang = nama_item"
dataset = pd.read_sql(sql_code, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")
 
display(dataset)

MySQL Connection is Close

  nama_barang         warna  nama_item kategori
0       bayam         hijau      bayam  sayuran
1        duku  kuning pekat       duku     buah
2      durian        kuning     durian     buah
3      gandum        coklat     gandum     buah
4   jambu air         merah  jambu air     buah
5       jeruk        oranye      jeruk     buah

In [56]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

sql_code = "select ms_item_kategori.*, ms_item_warna.* from ms_item_kategori, ms_item_warna where nama_barang = nama_item"
dataset = pd.read_sql(sql_code, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")
 
display(dataset)

MySQL Connection is Close

   nama_item kategori nama_barang         warna
0      bayam  sayuran       bayam         hijau
1       duku     buah        duku  kuning pekat
2     durian     buah      durian        kuning
3     gandum     buah      gandum        coklat
4  jambu air     buah   jambu air         merah
5      jeruk     buah       jeruk        oranye

In [57]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )
sql_ms_item_kategori = "select * from ms_item_kategori"
sql_ms_item_warna = "select * from ms_item_warna"

sql_code = "select ms_item_kategori.*, ms_item_warna.* from ms_item_kategori, ms_item_warna"
dataset = pd.read_sql(sql_code, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(dataset)

MySQL Connection is Close

    nama_item kategori nama_barang   warna
0       jeruk     buah        apel   merah
1   jambu air     buah        apel   merah
2       jamur  sayuran        apel   merah
3      gandum     buah        apel   merah
4      durian     buah        apel   merah
..        ...      ...         ...     ...
59     gandum     buah       jeruk  oranye
60     durian     buah       jeruk  oranye
61       duku     buah       jeruk  oranye
62  belimbing     buah       jeruk  oranye
63      bayam  sayuran       jeruk  oranye

[64 rows x 4 columns]

## Inner Join

In [58]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_inner_join = """select * from ms_item_warna
                    inner join ms_item_kategori
                    on ms_item_warna.nama_barang = ms_item_kategori.nama_item"""

dataset_inner = pd.read_sql(sql_inner_join, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(dataset_inner)

MySQL Connection is Close

  nama_barang         warna  nama_item kategori
0       bayam         hijau      bayam  sayuran
1        duku  kuning pekat       duku     buah
2      durian        kuning     durian     buah
3      gandum        coklat     gandum     buah
4   jambu air         merah  jambu air     buah
5       jeruk        oranye      jeruk     buah

In [59]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_inner_join = """select * from ms_item_warna
                    inner join ms_item_kategori
                    on ms_item_warna.nama_barang = ms_item_kategori.nama_item"""

sql_ms_produk = "select * from ms_product"
sql_ms_tr_penjualan = "select * from tr_penjualan"

df_sql_ms_produk = pd.read_sql(sql_ms_produk, connection)
df_sql_ms_tr_penjualan = pd.read_sql(sql_ms_tr_penjualan, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(df_sql_ms_produk)
display(df_sql_ms_tr_penjualan)

MySQL Connection is Close

   no_urut kode_produk                         nama_produk   harga
0        1     prod-01                  Kotak Pensil DQLab   62500
1        2     prod-02               Flashdisk DQLab 64 GB   55000
2        3     prod-03            Gift Voucher DQLab 100rb  100000
3        4     prod-04               Flashdisk DQLab 32 GB   40000
4        5     prod-05            Gift Voucher DQLab 250rb  250000
5        6     prod-06  Pulpen Multifunction + Laser DQLab   92500
6        7     prod-07          Tas Travel Organizer DQLab   48000
7        8     prod-08               Gantungan Kunci DQLab   15800
8        9     prod-09           Buku Planner Agenda DQLab   92000
9       10     prod-10       Sticky Notes DQLab 500 sheets   55000

,kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,harga
0,tr-001,dqlabcust07,1,prod-01,Kotak Pensil DQLab,5,62500
1,tr-001,dqlabcust07,2,prod-03,Flash disk DQLab 32 GB,1,100000
2,tr-001,dqlabcust07,3,prod-09,Buku Planner Agenda DQLab,3,92000
3,tr-001,dqlabcust07,4,prod-04,Flashdisk DQLab 32 GB,3,40000
4,tr-002,dqlabcust01,1,prod-03,Gift Voucher DQLab 100rb,2,100000
5,tr-002,dqlabcust01,2,prod-10,Sticky Notes DQLab 500 sheets,4,55000
6,tr-002,dqlabcust01,3,prod-07,Tas Travel Organizer DQLab,1,48000
7,tr-003,dqlabcust03,1,prod-02,Flashdisk DQLab 64 GB,2,55000
8,tr-004,dqlabcust03,1,prod-10,Sticky Notes DQLab 500 sheets,5,55000
9,tr-004,dqlabcust03,2,prod-04,Flashdisk DQLab 32 GB,4,40000
10,tr-005,dqlabcust05,1,prod-09,Buku Planner Agenda DQLab,3,92000
11,tr-005,dqlabcust05,2,prod-01,Kotak Pensil DQLab,1,62500
12,tr-005,dqlabcust05,3,prod-04,Flashdisk DQLab 32 GB,2,40000
13,tr-006,dqlabcust02,1,prod-05,Gift Voucher DQLab 250rb,4,250000
14,tr-006,dqlabcust02,2,prod-08,Gantungan Kunci DQLab,2,15800

In [60]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_inner_join = """select * from ms_item_warna
                    inner join ms_item_kategori
                    on ms_item_warna.nama_barang = ms_item_kategori.nama_item"""

sql_code = "select tr_penjualan.*, ms_product.* from tr_penjualan inner join ms_product on tr_penjualan.kode_produk = ms_product.kode_produk"
dataset = pd.read_sql(sql_code, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(dataset)

MySQL Connection is Close

,kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,harga,no_urut,kode_produk,nama_produk,harga
0,tr-001,dqlabcust07,1,prod-01,Kotak Pensil DQLab,5,62500,1,prod-01,Kotak Pensil DQLab,62500
1,tr-001,dqlabcust07,2,prod-03,Flash disk DQLab 32 GB,1,100000,3,prod-03,Gift Voucher DQLab 100rb,100000
2,tr-001,dqlabcust07,3,prod-09,Buku Planner Agenda DQLab,3,92000,9,prod-09,Buku Planner Agenda DQLab,92000
3,tr-001,dqlabcust07,4,prod-04,Flashdisk DQLab 32 GB,3,40000,4,prod-04,Flashdisk DQLab 32 GB,40000
4,tr-002,dqlabcust01,1,prod-03,Gift Voucher DQLab 100rb,2,100000,3,prod-03,Gift Voucher DQLab 100rb,100000
5,tr-002,dqlabcust01,2,prod-10,Sticky Notes DQLab 500 sheets,4,55000,10,prod-10,Sticky Notes DQLab 500 sheets,55000
6,tr-002,dqlabcust01,3,prod-07,Tas Travel Organizer DQLab,1,48000,7,prod-07,Tas Travel Organizer DQLab,48000
7,tr-003,dqlabcust03,1,prod-02,Flashdisk DQLab 64 GB,2,55000,2,prod-02,Flashdisk DQLab 64 GB,55000
8,tr-004,dqlabcust03,1,prod-10,Sticky Notes DQLab 500 sheets,5,55000,10,prod-10,Sticky Notes DQLab 500 sheets,55000
9,tr-004,dqlabcust03,2,prod-04,Flashdisk DQLab 32 GB,4,40000,4,prod-04,Flashdisk DQLab 32 GB,40000
10,tr-005,dqlabcust05,1,prod-09,Buku Planner Agenda DQLab,3,92000,9,prod-09,Buku Planner Agenda DQLab,92000
11,tr-005,dqlabcust05,2,prod-01,Kotak Pensil DQLab,1,62500,1,prod-01,Kotak Pensil DQLab,62500
12,tr-005,dqlabcust05,3,prod-04,Flashdisk DQLab 32 GB,2,40000,4,prod-04,Flashdisk DQLab 32 GB,40000
13,tr-006,dqlabcust02,1,prod-05,Gift Voucher DQLab 250rb,4,250000,5,prod-05,Gift Voucher DQLab 250rb,250000
14,tr-006,dqlabcust02,2,prod-08,Gantungan Kunci DQLab,2,15800,8,prod-08,Gantungan Kunci DQLab,15800

In [61]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_inner_join = """select
                    tr_penjualan.kode_transaksi,
                    tr_penjualan.kode_pelanggan,
                    tr_penjualan.kode_produk,
                    ms_product.nama_produk,
                    tr_penjualan.qty,
                    ms_product.harga*tr_penjualan.qty total
                    from
                    tr_penjualan
                    inner join ms_product
                    on
                    tr_penjualan.kode_produk = ms_product.kode_produk
                    """

dataset = pd.read_sql(sql_inner_join, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(dataset)

MySQL Connection is Close

,kode_transaksi,kode_pelanggan,kode_produk,nama_produk,qty,total
0,tr-001,dqlabcust07,prod-01,Kotak Pensil DQLab,5,312500
1,tr-001,dqlabcust07,prod-03,Gift Voucher DQLab 100rb,1,100000
2,tr-001,dqlabcust07,prod-09,Buku Planner Agenda DQLab,3,276000
3,tr-001,dqlabcust07,prod-04,Flashdisk DQLab 32 GB,3,120000
4,tr-002,dqlabcust01,prod-03,Gift Voucher DQLab 100rb,2,200000
5,tr-002,dqlabcust01,prod-10,Sticky Notes DQLab 500 sheets,4,220000
6,tr-002,dqlabcust01,prod-07,Tas Travel Organizer DQLab,1,48000
7,tr-003,dqlabcust03,prod-02,Flashdisk DQLab 64 GB,2,110000
8,tr-004,dqlabcust03,prod-10,Sticky Notes DQLab 500 sheets,5,275000
9,tr-004,dqlabcust03,prod-04,Flashdisk DQLab 32 GB,4,160000
10,tr-005,dqlabcust05,prod-09,Buku Planner Agenda DQLab,3,276000
11,tr-005,dqlabcust05,prod-01,Kotak Pensil DQLab,1,62500
12,tr-005,dqlabcust05,prod-04,Flashdisk DQLab 32 GB,2,80000
13,tr-006,dqlabcust02,prod-05,Gift Voucher DQLab 250rb,4,1000000
14,tr-006,dqlabcust02,prod-08,Gantungan Kunci DQLab,2,31600

## UNION

In [70]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_tabel_A = """select * from tabel_A"""
sql_tabel_B = """select * from tabel_B"""

tabel_A = pd.read_sql(sql_tabel_A, connection)
tabel_B = pd.read_sql(sql_tabel_B, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(tabel_A)
display(tabel_B)

MySQL Connection is Close

,kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,harga,total
0,tr-001,dqlabcust07,1,prod-01,Kotak Pensil DQLab,5,62500,312500
1,tr-003,dqlabcust03,2,prod-02,Flashdisk DQLab 64 GB,2,55000,110000
2,tr-002,dqlabcust01,3,prod-03,Gift Voucher DQLab 100rb,2,100000,200000
3,tr-001,dqlabcust07,4,prod-03,Gift Voucher DQLab 100rb,1,100000,100000
4,tr-001,dqlabcust07,1,prod-04,Flashdisk DQLab 32 GB,3,40000,120000
5,tr-002,dqlabcust01,2,prod-07,Tas Travel Organizer DQLab,1,48000,48000
6,tr-001,dqlabcust07,3,prod-09,Buku Planner Agenda DQLab,3,92000,276000
7,tr-002,dqlabcust01,1,prod-10,Sticky Note DQLab 500 sheets,4,55000,220000

,kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,harga,total
0,tr-004,dqlabcust03,1,prod-10,Sticky Notes DQLab 500 sheets,5,55000,275000
1,tr-004,dqlabcust03,2,prod-04,Flashdisk DQLab 32 GB,4,40000,160000
2,tr-005,dqlabcust05,1,prod-09,Buku Planner Agenda DQLab,3,92000,276000
3,tr-005,dqlabcust05,2,prod-01,Kotak Pensil DQLab,1,62500,62500
4,tr-005,dqlabcust05,3,prod-04,Flashdisk DQLab 32 GB,2,40000,80000
5,tr-006,dqlabcust02,1,prod-05,Gift Voucher DQLab 250rb,4,250000,1000000
6,tr-006,dqlabcust02,2,prod-08,Gantungan Kunci DQLab,2,15800,31600

In [71]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_tabel_A_union_tabel_B = """select * from tabel_A
                               union
                               select * from tabel_B"""

df_sql_tabel_A_union_tabel_B = pd.read_sql(sql_tabel_A_union_tabel_B , connection)


if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(df_sql_tabel_A_union_tabel_B )

MySQL Connection is Close

,kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,harga,total
0,tr-001,dqlabcust07,1,prod-01,Kotak Pensil DQLab,5,62500,312500
1,tr-003,dqlabcust03,2,prod-02,Flashdisk DQLab 64 GB,2,55000,110000
2,tr-002,dqlabcust01,3,prod-03,Gift Voucher DQLab 100rb,2,100000,200000
3,tr-001,dqlabcust07,4,prod-03,Gift Voucher DQLab 100rb,1,100000,100000
4,tr-001,dqlabcust07,1,prod-04,Flashdisk DQLab 32 GB,3,40000,120000
5,tr-002,dqlabcust01,2,prod-07,Tas Travel Organizer DQLab,1,48000,48000
6,tr-001,dqlabcust07,3,prod-09,Buku Planner Agenda DQLab,3,92000,276000
7,tr-002,dqlabcust01,1,prod-10,Sticky Note DQLab 500 sheets,4,55000,220000
8,tr-004,dqlabcust03,1,prod-10,Sticky Notes DQLab 500 sheets,5,55000,275000
9,tr-004,dqlabcust03,2,prod-04,Flashdisk DQLab 32 GB,4,40000,160000
10,tr-005,dqlabcust05,1,prod-09,Buku Planner Agenda DQLab,3,92000,276000
11,tr-005,dqlabcust05,2,prod-01,Kotak Pensil DQLab,1,62500,62500
12,tr-005,dqlabcust05,3,prod-04,Flashdisk DQLab 32 GB,2,40000,80000
13,tr-006,dqlabcust02,1,prod-05,Gift Voucher DQLab 250rb,4,250000,1000000
14,tr-006,dqlabcust02,2,prod-08,Gantungan Kunci DQLab,2,15800,31600

In [74]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_tabel_A_union_tabel_B = """select * from tabel_A
                               where kode_pelanggan = 'dqlabcust03'
                               union
                               select * from tabel_B
                               where kode_pelanggan = 'dqlabcust03'"""

df_sql_tabel_A_union_tabel_B = pd.read_sql(sql_tabel_A_union_tabel_B , connection)


if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(df_sql_tabel_A_union_tabel_B )

MySQL Connection is Close

,kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,harga,total
0,tr-003,dqlabcust03,2,prod-02,Flashdisk DQLab 64 GB,2,55000,110000
1,tr-004,dqlabcust03,1,prod-10,Sticky Notes DQLab 500 sheets,5,55000,275000
2,tr-004,dqlabcust03,2,prod-04,Flashdisk DQLab 32 GB,4,40000,160000

In [76]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_tabel_A_union_tabel_B = """select * from tabel_A
                               where kode_produk = 'prod-04'
                               union
                               select * from tabel_B
                               where kode_produk = 'prod-04'"""

df_sql_tabel_A_union_tabel_B = pd.read_sql(sql_tabel_A_union_tabel_B , connection)


if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(df_sql_tabel_A_union_tabel_B )

MySQL Connection is Close

,kode_transaksi,kode_pelanggan,no_urut,kode_produk,nama_produk,qty,harga,total
0,tr-001,dqlabcust07,1,prod-04,Flashdisk DQLab 32 GB,3,40000,120000
1,tr-004,dqlabcust03,2,prod-04,Flashdisk DQLab 32 GB,4,40000,160000
2,tr-005,dqlabcust05,3,prod-04,Flashdisk DQLab 32 GB,2,40000,80000

In [78]:
import mysql.connector as db
import pandas as pd
from IPython.display import display

connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                        )

sql_customer = """select * from customers"""
sql_supplier = """select * from supplier"""

df_customer = pd.read_sql(sql_customer, connection)
df_supplier = pd.read_sql(sql_supplier, connection)

if connection.is_connected():
    connection.close()
    print("MySQL Connection is Close")

display(df_customer)
display(df_supplier)

MySQL Connection is Close

,customerID,customerName,contactName,address,city,postalCode,country
0,1,Fransiska Maria,Maria,Jl Sudirman,Jakarta,14450,Indonesia
1,2,Ana Helena,Ana Helena,Jl Madura,Surabaya,5021,Indonesia
2,3,Lily Subari,Lili,Jl Sumba,Makassar,5023,Indonesia

,supplierID,contactName,supplierName,address,city,postalCode,country
0,1,Yulius,Yulius Syrup,Jl Jayakarta,Jakarta,14450,Indonesia
1,2,Sherly Ani,Bandung Bakery,Jalan Asia Afrika,Bandung,70117,Indoensia
2,3,Regina Tara,Tara Pastry,Jalan Merpati,Semarang,48104,Indonesia